Revit 2026 API

# StoneStoneBump Property

---

The property labeled "Type" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string StoneBump { get; }
```
```vb
Public Shared ReadOnly Property StoneBump As String
	Get
```
```cpp
public:
static property String^ StoneBump {
	String^ get ();
}
```
```fsharp
static member StoneBump : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StoneBumpType".

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace